
#  梅花易数法
#  天乾 泽兑 火离 雷震 风巽 水坎 山艮 地坤
#  以数起卦：三组数，除8取余得上下卦，除6取余得爻
#  以时起卦：即以农历之年月日总和除8取余得上卦；以年月日时总和除8取余得下卦，再以年月日时总和除6取余得爻
#  注: 整除时余数取8/6
#  子时	丑时	寅时	卯时	辰时	巳时
# 23:00-00:59	01:00-02:59	03:00-04:59	05:00-06:59 07:00-08:59
# 09:00-10:59 午时	未时	申时	酉时	戊时	亥时 11:00-12:59
# 13:00-14:59	15:00-16:59	17:00-18:59	19:00-20:59	21:00-22:59


# 2014-1-18-14:10 => 2013年12月18日，甲午年，午为7数，14:10分为未时8数 =>
# 年月日时7 12 18 8，上卦为风巽, 下卦为风巽, 动爻为3爻 2019-5-2-02:13  =>
# 2019年3月8日，己亥年，亥为12数，02:13分为丑时2数  => 年月日时12 3 8
# 2，上卦为山艮, 下卦为天乾, 动爻为1爻

def main():

    print("Please input three array: ");
    i = int(input('请输入第一组三位数:'))
    j = int(input('请输入第二组三位数:'))
    k = int(input('请输入第三组三位数:'))

    # 上卦，下卦，爻
    up = 0
    low = 0
    yao = 0
    GUA = ["天乾", "泽兑", "火离", "雷震", "风巽", "水坎", "山艮", "地坤"]
    if i % 8:
        up = i % 8
    else:
        up = 8
    if j % 8:
        low = j % 8
    else:
        low = 8
    if k % 6:
        yao = k % 6
    else:
        yao = 6

    # print("Result: 上卦为%s, 下卦为%s, 动爻为%d爻", GUA[up - 1], GUA[low - 1],yao)
    print(f"Result: 上卦为{GUA[up - 1]}, 下卦为{GUA[low - 1]}, 动爻为{yao}爻")

if __name__ == '__main__':
    main()
